app/services/scrape_service.rb

INSERT INTO "posts" ("title", "created_at", "updated_at", "published_at") VALUES ('【画像】この漫画の二コマ目で喋ってるのが一人だけってマジ？', '2025-09-21 05:04:33.424027', '2025-09-21 05:04:33.424027', '2025-10-15 7:00') RETURNING "id"
---
  def call(index = 0)
    html = URI.open(@url, read_timeout: 20, open_timeout: 10, 'User-Agent' => 'Mozilla/5.0').read
    doc  = Nokogiri::HTML.parse(html)

    body = doc.at('article.post') || doc
    title_text = body.at('h1.post__title')&.text&.strip.presence || URI.parse(@url).host

    contents = body.css('div.post__content')
    container = contents.first || body

    date_nodes   = container.css('div.t_h')
    detail_nodes = container.css('div.t_b')

    count = [date_nodes.size, detail_nodes.size].min
    time = TIMES[index % TIMES.size]
    published_at = @date.present? ? "#{@date} #{time}" : nil

    post = Post.create!(title: title_text, published_at: published_at)