app/controllers/posts_controller.rb

  def index
    posts = Post.select(:id, :title, :published_at, :created_at).order(created_at: :asc)
---
SELECT "posts"."id", "posts"."title", "posts"."published_at", "posts"."created_at" FROM "posts" ORDER BY "posts"."created_at" ASC

def show
  post = Post.includes(:details).find_by(id: params[:id])
  if post
    render json: {
      id: post.id,
      title: post.title,
      published_at: post.published_at,
      created_at: post.created_at,
      details: post.details.order(:id).map { |d|
---
SELECT "details".* FROM "details" WHERE "details"."post_id" = 16