app/controllers/scrapes_controller.rb

INSERT INTO "posts" ("title", "created_at", "updated_at", "published_at") VALUES ('【画像】この漫画の二コマ目で喋ってるのが一人だけってマジ？', '2025-09-21 05:04:33.424027', '2025-09-21 05:04:33.424027', '2025-10-15 7:00') RETURNING "id"
---
  def create
    urls = Array(params[:urls]).map(&:to_s).reject(&:blank?)
    date = params[:date]
    return render json: { error: 'urls required' }, status: :bad_request if urls.empty?

    posts = []
    errors = []

    urls.each_with_index do |url, index|
      begin
        post = ScrapeService.new(url, date).call(index)
        posts << { id: post.id, title: post.title, published_at: post.published_at }